{
  "backend/main.mo": "Main Motoko canister managing announcements, events, staff profiles, settings, and gallery blobs with admin‑gated CRUD and publishing logic.",
  "feature_evidence.json": "Empty feature evidence report structure.",
  "frontend-file-summaries.txt": "Prewritten summaries for several frontend files, mainly admin pages and layout components.",
  "frontend/index.css": "Tailwind base styles defining OKLCH color variables for light and dark themes.",
  "frontend/index.html": "Base HTML file mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes for public and admin pages, wrapped with theming and toaster UI.",
  "frontend/src/components/auth/AdminGate.tsx": "Gate component that checks authentication and admin status before rendering admin content.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button using Internet Identity with status handling and query cache clearing.",
  "frontend/src/components/forms/ContactForm.tsx": "Client‑side‑validated contact form with demo submission confirmation.",
  "frontend/src/components/layout/SiteFooter.tsx": "Footer displaying quick links and contact info from site settings, plus a small attribution section.",
  "frontend/src/components/layout/SiteHeader.tsx": "Responsive site header with navigation links, admin link handling, login button, and mobile menu drawer.",
  "frontend/src/components/layout/SiteLayout.tsx": "Page layout wrapper that renders header, footer, and main content area.",
  "frontend/src/components/state/ErrorSection.tsx": "Reusable error display component showing an alert with a title and message.",
  "frontend/src/components/state/LoadingSection.tsx": "Skeleton-based loading placeholder that renders a configurable number of skeleton blocks.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useAdminContent.ts": "React Query hooks for fetching and mutating admin-managed announcements, events, staff profiles, and settings.",
  "frontend/src/hooks/useAdminStatus.ts": "Checks if the current authenticated user is an admin using the backend actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, handling login, logout, and identity persistence.",
  "frontend/src/hooks/usePublicContent.ts": "React Query hooks for fetching published announcements, events, staff, gallery entries, and settings.",
  "frontend/src/index.css": "Tailwind base styles and theme variables defining a green-and-cream light/dark color palette.",
  "frontend/src/main.tsx": "App entry point initializing React, QueryClient, InternetIdentityProvider, and global styles.",
  "frontend/src/pages/AboutPage.tsx": "Renders the About page with mission, vision, core values, and school history using cards and sections.",
  "frontend/src/pages/AcademicsPage.tsx": "Displays academic information including curriculum highlights, subjects offered, and the school’s learning approach.",
  "frontend/src/pages/admin/AdminAnnouncementsPage.tsx": "Admin interface to create, edit, publish, and delete announcements using dialogs and form controls.",
  "frontend/src/pages/admin/AdminDashboardPage.tsx": "Landing page for admin with cards linking to announcement, event, staff, gallery, and settings management sections.",
  "frontend/src/pages/admin/AdminEventsPage.tsx": "Admin tool for creating, editing, and deleting events, including date handling and publication toggles.",
  "frontend/src/pages/admin/AdminGalleryPage.tsx": "Admin page for uploading images to the gallery with progress tracking and display of existing published items.",
  "frontend/src/pages/admin/AdminSettingsPage.tsx": "Admin page to view and edit site contact settings by loading existing values and saving updates via mutations.",
  "frontend/src/pages/admin/AdminStaffPage.tsx": "Admin interface for creating, editing, and deleting staff profiles with dialog-based form handling.",
  "frontend/src/pages/AdmissionsPage.tsx": "Shows admissions details such as eligibility, required documents, and current admission status alerts.",
  "frontend/src/pages/AnnouncementsPage.tsx": "Fetches and displays published announcements with loading and error states and fallback messaging.",
  "frontend/src/pages/ContactPage.tsx": "Provides contact details from site settings and includes a form for sending messages.",
  "frontend/src/pages/EventsPage.tsx": "Fetches and lists school events with date formatting, upcoming indicators, and error/loading handling.",
  "frontend/src/pages/GalleryPage.tsx": "Loads and displays gallery images with responsive grid layout and handles loading and error states.",
  "frontend/src/pages/HomePage.tsx": "Public homepage showing hero banner, feature cards, and recent announcements, events, staff, and gallery previews loaded from hooks.",
  "frontend/src/pages/StaffPage.tsx": "Displays published staff profiles with avatars, bios, and contact info, handling loading and error states.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading URL parameters, persisting them in sessionStorage, and clearing them from the URL hash.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme extensions, color tokens, animations, and loaded plugins.",
  "project_state.json": "Metadata file describing project state, existing features, requirements, and versioning info."
}