{
  "backend/main.mo": "Motoko backend actor managing announcements, events, staff, gallery, settings, and admin bootstrap with access control and blob storage integration.",
  "feature_evidence.json": "Feature evidence report listing build/deploy features, related files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Prewritten summaries of various frontend files including admin pages, hooks, deployment scripts, and documentation.",
  "frontend/deploy-logs/.gitkeep": "Placeholder file ensuring the deploy-logs directory exists in version control.",
  "frontend/docs/deploy/deploy-log-capture.md": "Guide explaining how to capture and share full deployment logs for debugging.",
  "frontend/docs/deploy/retry-deploy.md": "Runbook detailing prerequisites and step-by-step instructions for re-running the full build and deployment process.",
  "frontend/index.css": "Tailwind CSS base defining global OKLCH color variables and light/dark theme styles.",
  "frontend/index.html": "Basic HTML entry point containing root mount div and script loader for the frontend app.",
  "frontend/scripts/retry-deploy.sh": "Script performing dependency install, backend binding generation, frontend build, and canister deployment.",
  "frontend/scripts/run-deploy-with-full-logs.sh": "Wrapper script executing the retry deploy script while capturing full logs to a timestamped file.",
  "frontend/src/App.tsx": "Main React app configuring all site and admin routes with theming and router provider.",
  "frontend/src/components/auth/AdminGate.tsx": "Authorization gate component enforcing admin access with login prompts, bootstrap flow, and principal display.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button that uses Internet Identity to authenticate and clears cached queries on logout.",
  "frontend/src/components/forms/ContactForm.tsx": "Client-side contact form with validation, submission state, and a demo success message.",
  "frontend/src/components/layout/SiteFooter.tsx": "Footer displaying site links, contact info from settings, and a branded attribution link.",
  "frontend/src/components/layout/SiteHeader.tsx": "Responsive site header with navigation, admin link, login button, and mobile menu.",
  "frontend/src/components/layout/SiteLayout.tsx": "Page layout wrapper combining header, main content area, and footer.",
  "frontend/src/components/state/ErrorSection.tsx": "Reusable error alert component with customizable title and message.",
  "frontend/src/components/state/LoadingSection.tsx": "Skeleton-based loading placeholder rendering multiple content blocks.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor instance based on identity and refreshes dependent queries on change.",
  "frontend/src/hooks/useAdminContent.ts": "Admin-focused hooks for fetching, creating, updating, and deleting announcements, events, and staff profiles.",
  "frontend/src/hooks/useAdminStatus.ts": "Checks whether the authenticated caller is an admin using the backend actor.",
  "frontend/src/hooks/useCallerPrincipalText.ts": "Fetches the caller’s principal text from the backend with identity fallback.",
  "frontend/src/hooks/useFirstAdminBootstrap.ts": "Manages first-admin bootstrap availability and triggers the bootstrap process.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements a React context and provider for managing Internet Identity authentication using AuthClient, exposing identity state, login, and logout helpers.",
  "frontend/src/hooks/usePublicContent.ts": "Provides React Query hooks to fetch public content—announcements, events, staff, gallery, and settings—via an actor from the backend.",
  "frontend/src/index.css": "Defines TailwindCSS base styles and custom CSS variables for light and dark themes with a green-and-cream palette.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with QueryClientProvider and InternetIdentityProvider before rendering App.",
  "frontend/src/pages/AboutPage.tsx": "Renders the About page with sections describing the school’s mission, vision, core values, and history using styled cards.",
  "frontend/src/pages/AcademicsPage.tsx": "Displays academic information including curriculum, teachers, resources, schedule, subjects offered, and learning approach.",
  "frontend/src/pages/admin/AdminAnnouncementsPage.tsx": "Provides an admin interface to create, edit, and delete announcements using dialogs and form inputs.",
  "frontend/src/pages/admin/AdminDashboardPage.tsx": "Displays the admin dashboard with links to content management sections like announcements, events, staff, gallery, and settings.",
  "frontend/src/pages/admin/AdminEventsPage.tsx": "Admin UI for creating, editing, publishing, and deleting events with a modal form and event CRUD hooks.",
  "frontend/src/pages/admin/AdminGalleryPage.tsx": "Admin page for uploading images to the gallery with progress tracking and publishing uploaded file IDs.",
  "frontend/src/pages/admin/AdminSettingsPage.tsx": "Admin interface for editing and saving site contact settings using form fields and settings API hooks.",
  "frontend/src/pages/admin/AdminStaffPage.tsx": "Admin UI to create, edit, and delete staff profiles via a modal, including bio, contact info, and publish status.",
  "frontend/src/pages/AdmissionsPage.tsx": "Shows admissions information such as eligibility, required documents, and notices using cards and alerts.",
  "frontend/src/pages/AnnouncementsPage.tsx": "Fetches and displays published announcements with loading and error states, formatting each announcement in a card layout.",
  "frontend/src/pages/ContactPage.tsx": "Displays contact information fetched from site settings and shows a contact form, with loading placeholders if data is not ready.",
  "frontend/src/pages/EventsPage.tsx": "Fetches and lists published events with formatted dates, upcoming badges, and loading/error handling.",
  "frontend/src/pages/GalleryPage.tsx": "Loads and displays a gallery grid of published images with loading skeletons and error/empty states.",
  "frontend/src/pages/HomePage.tsx": "Shows the homepage hero section and previews of announcements, events, staff, and gallery items using public content hooks.",
  "frontend/src/pages/StaffPage.tsx": "Fetches and lists staff members with names, positions, bios, and contact info, including loading and error states.",
  "frontend/src/utils/urlParams.ts": "Utility for reading, storing, and clearing URL or session-based parameters, supporting hash routing.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, colors, animations, and plugins for the frontend.",
  "project_state.json": "Defines the project’s current state, including features, issues, admin allowlist notes, and a request to fix deployment and admin access problems."
}